nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qsci.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
#define FSL_QSCI_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/* ============================================= General Control Macro ============================================== */
/*! @brief Retry times when checking status flags. */
#ifndef QSCI_RETRY_TIMES
#define QSCI_RETRY_TIMES 0U /* Default defines to zero, driver keeps checking status flag untill it changes. */
#endif

/* ================================================ Callback Macro ================================================== */
/*! @brief Macros to be used inside user callback. */
#define QSCI_GET_BUS_STATUS(psHandle) (psHandle)->busStatus
#define QSCI_GET_TRANSFER_USER_DATA(psHandle) (psHandle)->pUserData

/*! @brief Status codes for the QSCI driver. */
enum
{
    kStatus_QSCI_TxBusy = MAKE_STATUS(kStatusGroup_QSCI, 0U), /*!< Transmitter is busy. */
    kStatus_QSCI_RxBusy = MAKE_STATUS(kStatusGroup_QSCI, 1U), /*!< Receiver is busy. */
    kStatus_QSCI_TxIdle = MAKE_STATUS(kStatusGroup_QSCI, 2U), /*!< Transmitter is idle. */
    kStatus_QSCI_RxIdle = MAKE_STATUS(kStatusGroup_QSCI, 3U), /*!< Receiver is idle. */
    kStatus_QSCI_FlagCannotClearManually =
        MAKE_STATUS(kStatusGroup_QSCI, 4), /*!< Status flag can't be manually cleared. */
    kStatus_QSCI_RxRingBufferOverrun = MAKE_STATUS(kStatusGroup_QSCI, 5U), /*!< QSCI RX software ring buffer overrun. */
    kStatus_QSCI_RxHardwareOverrun   = MAKE_STATUS(kStatusGroup_QSCI, 6U), /*!< QSCI receiver hardware overrun. */
    kStatus_QSCI_NoiseError          = MAKE_STATUS(kStatusGroup_QSCI, 7U), /*!< QSCI noise error. */
    kStatus_QSCI_FramingError        = MAKE_STATUS(kStatusGroup_QSCI, 8U), /*!< QSCI framing error. */
    kStatus_QSCI_ParityError         = MAKE_STATUS(kStatusGroup_QSCI, 9U), /*!< QSCI parity error. */
    kStatus_QSCI_BaudrateNotSupport =
        MAKE_STATUS(kStatusGroup_QSCI, 10), /*!< Baudrate is not supported in current clock source */
    kStatus_QSCI_IdleLineDetected = MAKE_STATUS(kStatusGroup_QSCI, 11), /*!< QSCI IDLE line detected. */
    kStatus_QSCI_Timeout =
        MAKE_STATUS(kStatusGroup_QSCI, 12), /*!< Timeout happens when waiting for status flags to change. */
};

/* ================================== Functional Group Structure/Enumeration List =================================== */
/* ---------------------------------------- Hardware Status Flags Sub-group ----------------------------------------- */
/*!
 * @brief QSCI hardware status flags.
 *
 * These enumerations can be ORed together to form bit masks.
 */
enum _qsci_status_flags
{
    kQSCI_TxDataRegEmptyFlag = QSCI_STAT_TDRE_MASK,  /*!< TX data register empty flag. */
    kQSCI_TxIdleFlag         = QSCI_STAT_TIDLE_MASK, /*!< Transmission idle flag. */
    kQSCI_RxDataRegFullFlag  = QSCI_STAT_RDRF_MASK,  /*!< RX data register full flag. */
    kQSCI_RxIdleLineFlag     = QSCI_STAT_RIDLE_MASK, /*!< Rx Idle line flag. */

    kQSCI_RxOverrunFlag    = QSCI_STAT_OR_MASK, /*!< RX overrun flag. */
    kQSCI_RxNoiseFlag      = QSCI_STAT_NF_MASK, /*!< RX detect noise on Rx input. */
    kQSCI_RxFrameErrorFlag = QSCI_STAT_FE_MASK, /*!< Rx frame error flag, sets if logic 0 was detected for stop bit*/
    kQSCI_RxParityErrorFlag =
        QSCI_STAT_PF_MASK, /*!< Rx parity error if parity enabled, sets upon parity error detection */

    kQSCI_RxInputEdgeFlag =
        QSCI_STAT_RIEF_MASK, /*!< RX pin active edge interrupt flag, sets when active edge detected */
    kQSCI_LINSyncErrorFlag = QSCI_STAT_LSE_MASK,  /*!< Only for LIN mode. */
    kQSCI_TxDMARequestFlag = QSCI_STAT_TDMA_MASK, /*!< Tx DMA request is ongoing. */
    kQSCI_RxDMARequestFlag = QSCI_STAT_RDMA_MASK, /*!< Rx DMA request is ongoing. */
    kQSCI_RxActiveFlag     = QSCI_STAT_RAF_MASK,  /*/< Rx reception is in progress. */

    kQSCI_Group0Flags = kQSCI_TxDataRegEmptyFlag | kQSCI_TxIdleFlag | kQSCI_RxDataRegFullFlag | kQSCI_TxDMARequestFlag |
                        kQSCI_RxDMARequestFlag | kQSCI_RxActiveFlag, /*!< Members in kQSCI_Group0Flags can't
                                                 be cleared by QSCI_ClearStatusFlags, they are handled by HW. */
    kQSCI_Group1Flags = kQSCI_RxOverrunFlag | kQSCI_RxNoiseFlag | kQSCI_RxFrameErrorFlag | kQSCI_RxParityErrorFlag |
                        kQSCI_LINSyncErrorFlag, /*!< Whole kQSCI_Group1Flags will be cleared if trying to clear any
                                                   member in kQSCI_Group1Flags or kQSCI_Group2Flags in the mask. */
    kQSCI_Group2Flags =
        kQSCI_RxInputEdgeFlag | kQSCI_RxIdleLineFlag, /*!< Member in kQSCI_Group2Flags can be cleared individually */
    kQSCI_StatusAllFlags = kQSCI_Group1Flags | kQSCI_Group2Flags
};
/* -------------------------------------- End of Hardware Status Flags Sub-group ------------------------------------ */

/* ----------------------------------------------- Interrupt Sub-group ---------------------------------------------- */
/*!
 * @brief QSCI interrupt enable/disable source.
 *
 * These enumerations can be ORed together to form bit masks.
 */
enum _qsci_interrupt_enable
{
    kQSCI_TxEmptyInterruptEnable     = QSCI_CTRL1_TEIE_MASK,        /*!< Transmit data register empty interrupt. */
    kQSCI_TxIdleInterruptEnable      = QSCI_CTRL1_TIIE_MASK,        /*!< Transmission idle interrupt. */
    kQSCI_RxFullInterruptEnable      = QSCI_CTRL1_RFIE_MASK,        /*!< Receive data register full interrupt. */
    kQSCI_RxErrorInterruptEnable     = QSCI_CTRL1_REIE_MASK,        /*!< Receive error interrupt. */
    kQSCI_RxInputEdgeInterruptEnable = QSCI_CTRL2_RIEIE_MASK >> 2U, /*!< Receive input edge interrupt. */
    kQSCI_RxIdleLineInterruptEnable  = QSCI_CTRL2_RIIE_MASK >> 2U,  /*!< Receive idle interrupt. */
    kQSCI_AllInterruptEnable         = kQSCI_TxEmptyInterruptEnable | kQSCI_TxIdleInterruptEnable |
                               kQSCI_RxFullInterruptEnable | kQSCI_RxErrorInterruptEnable |
                               kQSCI_RxInputEdgeInterruptEnable | kQSCI_RxIdleLineInterruptEnable
};
/* ------------------------------------------- End of Interrupt Sub-group ------------------------------------------- */

