nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qsci.h
/* --------------------------------------- Peripheral Configuration Sub-group --------------------------------------- */
/*! @brief QSCI transmiter/receiver loop mode. */
typedef enum _qsci_transfer_mode
{
    kQSCI_Normal       = 0U, /*!< Normal mode, 2 signal pins, no loop. */
    kQSCI_LoopInternal = 1U, /*!< Loop mode with internal TXD fed back to RXD. */
    kQSCI_SingleWire   = 2U  /*!< Use tx pin as input and output half-duplex transfer. */
} qsci_transfer_mode_t;

/*! @brief QSCI data bit count. */
typedef enum _qsci_data_bit_mode
{
    kQSCI_Data8Bit = 0U, /*!< 1 start bit, 8 data bit, 1 stop bit */
    kQSCI_Data9Bit =
        1U /*!< 1 start bit, 9 data bit, 1 stop bit. This mode actually is not supported yet in driver. */ // TODO
} qsci_data_bit_mode_t;

/*! @brief QSCI wakeup mode. */
typedef enum _qsci_wakeup_mode
{
    kQSCI_WakeupOnIdleLine    = 0U, /*!< Idle condition wakes the QSCI module. */
    kQSCI_WakeupOnAddressMark = 1U  /*!< Address mark wakes the QSCI module. */
} qsci_wakeup_mode_t;

/*! @brief QSCI signal polarity mode. */
typedef enum _qsci_polarity_mode
{
    kQSCI_PolarityNormal = 0U, /*!< Normal mode, no inversion. */
    kQSCI_PolarityInvert = 1U  /*!< Invert transmit and receive data bits. */
} qsci_polarity_mode_t;

/*! @brief QSCI parity mode. */
typedef enum _qsci_parity_mode
{
    kQSCI_ParityDisabled = 0x0U, /*!< Parity disabled */
    kQSCI_ParityEven     = 0x1U, /*!< Parity enabled, type even, bit setting: PE|PT = 10 */
    kQSCI_ParityOdd      = 0x2U  /*!< Parity enabled, type odd,  bit setting: PE|PT = 11 */
} qsci_parity_mode_t;

/*! @brief QSCI transmitter watermark level. */
typedef enum _qsci_tx_water
{
    kQSCI_TxWater0Word = 0x0U, /*!< Tx interrupt sets when tx fifo empty. */
    kQSCI_TxWater1Word = 0x1U, /*!< Tx interrupt sets when tx fifo has 1 or few word. */
    kQSCI_TxWater2Word = 0x2U, /*!< Tx interrupt sets when tx fifo has 2 or few words. */
    kQSCI_TxWater3Word = 0x3U  /*!< Tx interrupt sets when tx fifo not full. */
} qsci_tx_water_t;

/*! @brief QSCI receiver watermark level. */
typedef enum _qsci_rx_water
{
    kQSCI_RxWater1Word = 0x0U, /*!< Rx interrupt sets when rx fifo not empty. */
    kQSCI_RxWater2Word = 0x1U, /*!< Rx interrupt sets when rx fifo has at least 1 word. */
    kQSCI_RxWater3Word = 0x2U, /*!< Rx interrupt sets when rx fifo has at least 2 words. */
    kQSCI_RxWater4Word = 0x3U  /*!< Rx interrupt sets when rx fifo full. */
} qsci_rx_water_t;
/* ----------------------------------- End of Peripheral Configuration Sub-group ------------------------------------ */

/* ----------------------------------- Module Initialize/De-initialize Sub-group ------------------------------------ */
/*! @brief QSCI configuration structure. */
typedef struct _qsci_config
{
    qsci_transfer_mode_t eTransferMode : 2; /*!< Transmitter/receiver loop mode. */
    bool bStopInWaitEnable : 1;             /*!< Enable/disable module stops working in wait mode. */
    qsci_data_bit_mode_t eDataBitMode : 1;  /*!< Number of data bits. */
    qsci_wakeup_mode_t eWakeupMode : 1;     /*!< Receiver wakeup mode, idle line or addressmark. */
    qsci_polarity_mode_t ePolarityMode : 1; /*!< Polarity of transmit/receive data. */
    qsci_parity_mode_t eParityMode : 2;     /*!< Parity mode, disabled (default), even, odd. */
    bool bEnableStopHold : 1;               /*!< Control the stop hold enable. */
    bool bEnableTx : 1;                     /*!< Enable TX */
    bool bEnableRx : 1;                     /*!< Enable RX */
    bool bEnableFifo : 1;                   /*!< Enable Tx/Rx FIFO */
    bool bEnableTxDMA : 1;                  /*!< Enable Tx DMA */
    bool bEnableRxDMA : 1;                  /*!< Enable Rx DMA */
    qsci_tx_water_t eTxFifoWatermark : 2;   /*!< TX FIFO watermark */
    qsci_rx_water_t eRxFifoWatermark : 2;   /*!< RX FIFO watermark */
    uint8_t u8Interrupts;                   /*!< Mask of QSCI interrupt sources to enable. */
    uint32_t u32BaudRateBps;                /*!< QSCI baud rate  */
    uint32_t u32SrcClockHz;                 /*!< The clock source frequency for QSCI module. */
} qsci_config_t;
/* -------------------------------- End of Module Initialize/De-initialize Sub-group -------------------------------- */

/* ================================= Transactional Group Structure/Enumeration List  ================================ */
/* Forward declaration of the handle typedef. */
typedef struct _qsci_transfer_handle_t qsci_transfer_handle_t;

/*!
 * @brief QSCI interrupt transfer callback function definition
 *
 * Defines the interface of user callback function used in QSCI interrupt transfer using transactional APIs. The
 * callback function shall be defined and declared in application level by user. Before starting QSCI transmiting or
 * receiving by calling @ref QSCI_TransferSendNonBlocking or @ref QSCI_TransferReceiveNonBlocking, call
 * @ref QSCI_TransferCreateHandle to install the user callback. When the transmiting or receiving ends or any bus error
 * like hardware overrun occurs, user callback will be invoked by driver.
 *
 * @param psHandle Transfer handle that contains bus status, user data.
 */
typedef void (*qsci_transfer_callback_t)(qsci_transfer_handle_t *psHandle);

/*!
 * @brief QSCI transfer handle
 *
 * @note If user wants to use the transactional API to transfer data in interrupt way, one QSCI instance should and can
 * only be allocated one handle.
 * @note The handle is maintained by QSCI driver internally, which means the transfer state is retained and user shall
 * not modify its state #u8TxState or #u8RxState in application level. If user only wish to use transactional APIs
 * without understanding its machanism, it is not necessary to understand these members.
 */
struct _qsci_transfer_handle_t
{
    QSCI_Type *base; /*!< QSCI base pointer to the instance belongs to this handle. */

    uint8_t *pu8TxData;                   /*!< Address of remaining data to send. */
    volatile uint32_t u32TxRemainingSize; /*!< Size of the remaining data to send. */
    uint32_t u32TxDataSize;               /*!< Size of the data to send out. */
    uint8_t *pu8RxData;                   /*!< Address of remaining data to receive. */
    volatile uint32_t u32RxRemainingSize; /*!< Size of the remaining data to receive. */
    uint32_t u32RxDataSize;               /*!< Size of the data to receive. */

    uint8_t *pu8RxRingBuffer;              /*!< Start address of the receiver ring buffer. */
    uint16_t u16RxRingBufferSize;          /*!< Size of the ring buffer. */
    volatile uint16_t u16RxRingBufferHead; /*!< Index for the driver to store received data into ring buffer. */
    volatile uint16_t u16RxRingBufferTail; /*!< Index for the user to get data from the ring buffer. */

    qsci_transfer_callback_t pfCallback; /*!< Callback function. */
    void *pUserData;                     /*!< QSCI callback function parameter.*/

