nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_qsci.h
    volatile uint8_t u8TxState; /*!< TX transfer state. */
    volatile uint8_t u8RxState; /*!< RX transfer state */

    status_t busStatus; /*!< QSCI bus status. */
};

/*! @brief QSCI transfer structure. */
typedef struct _qsci_transfer
{
    uint8_t *pu8Data;     /*!< The buffer pointer of data to be transferred.*/
    uint32_t u32DataSize; /*!< The byte count to be transferred. */
} qsci_transfer_t;
/* ============================== End of Transactional Group Structure/Enumeration List  ============================ */

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif
/* =========================================== Functional Group API List ============================================ */
/*!
 * @name Module Init/Deinit Sub-group
 * @{
 */
/*!
 * @brief Sets the QSCI configuration structure to default values.
 *
 * The purpose of this API is to initialize the configuration structure to default value for @ref QSCI_Init to use.
 * Use the unchanged structure in @ref QSCI_Init or modify the structure before calling @ref QSCI_Init.
 * This is an example:
 * @code
 *   qsci_config_t sConfig;
 *   QSCI_GetDefaultConfig(&sConfig, 115200, 12000000U);
 *   QSCI_Init(QSCI0, &config);
 * @endcode
 *
 * @param psConfig Pointer to configuration structure.
 * @param u32BaudRateBps Baudrate setting.
 * @param u32SrcClockHz The clock source frequency for QSCI module.
 */
void QSCI_GetDefaultConfig(qsci_config_t *psConfig, uint32_t u32BaudRateBps, uint32_t u32SrcClockHz);

/*!
 * @brief Initializes the QSCI instance with a user configuration structure.
 *
 * This function configures the QSCI module with the customed settings. User can configure the configuration structure
 * manually or get the default configuration by using the @ref QSCI_GetDefaultConfig function.
 * The example below shows how to use this API to configure QSCI.
 * @code
 *   qsci_config_t sConfig;
 *   QSCI_GetDefaultConfig(&sConfig, 115200, 12000000U);
 *   QSCI_Init(QSCI0, &sConfig);
 * @endcode
 *
 * @param base QSCI peripheral base address.
 * @param psConfig Pointer to the user-defined configuration structure.
 * @retval kStatus_QSCI_BaudrateNotSupport Baudrate is not supported in the current clock source.
 * @retval kStatus_Success Set baudrate succeeded.
 */
status_t QSCI_Init(QSCI_Type *base, qsci_config_t *psConfig);

/*!
 * @brief Deinitializes a QSCI instance.
 *
 * This function waits for transmiting complete, then disables TX and RX.
 *
 * @param base QSCI peripheral base address.
 */
void QSCI_Deinit(QSCI_Type *base);
/* @} */

/*!
 * @name Hardware Status Flags Sub-group
 * @{
 */
/*!
 * @brief Gets QSCI hardware status flags.
 *
 * @param base QSCI peripheral base address.
 * @return QSCI status flags, can be a single flag or several flags in #_qsci_status_flags combined by OR.
 */
static inline uint16_t QSCI_GetStatusFlags(QSCI_Type *base)
{
    return (uint16_t)base->STAT;
}

/*!
 * @brief Clears QSCI status flags.
 *
 * This function clears QSCI status flags. Members in kQSCI_Group0Flags can't be cleared by this function, they are
 * cleared or set by hardware.
 *
 * @param base QSCI peripheral base address.
 * @param u16StatusFlags The status flag mask, can be a single flag or several flags in #_qsci_status_flags combined by
 * OR.
 */
void QSCI_ClearStatusFlags(QSCI_Type *base, uint16_t u16StatusFlags);
/* @} */

/*!
 * @name Interrupt Sub-group
 * @{
 */
/*!
 * @brief Enables QSCI interrupts according to the provided mask.
 *
 * This function enables the QSCI interrupts according to the provided mask. The mask is a logical OR of enumeration
 * members in #_qsci_interrupt_enable.
 *
 * @param base QSCI peripheral base address.
 * @param u8Interrupts The interrupt source mask, can be a single source or several sources in #_qsci_interrupt_enable
 * combined by OR.
 */
void QSCI_EnableInterrupts(QSCI_Type *base, uint8_t u8Interrupts);

/*!
 * @brief Disables QSCI interrupts according to the provided mask.
 *
 * This function disables the QSCI interrupts according to the provided mask. The mask is a logical OR of enumeration
 * members in #_qsci_interrupt_enable.
 *
 * @param base QSCI peripheral base address.
 * @param u8Interrupts The interrupt source mask, can be a single source or several sources in #_qsci_interrupt_enable
 * combined by OR.
 */
void QSCI_DisableInterrupts(QSCI_Type *base, uint8_t u8Interrupts);

/*!
 * @brief Gets the enabled QSCI interrupts.
 *
 * This function gets the enabled QSCI interrupts. The enabled interrupts are returned as the logical OR value of the
 * enumerators #_qsci_interrupt_enable.
 *
 * @param base QSCI peripheral base address.
 * @return The interrupt source mask, can be a single source or several sources in #_qsci_interrupt_enable combined
 * by OR.
 */
uint8_t QSCI_GetEnabledInterrupts(QSCI_Type *base);
/* @} */

/*!
 * @name General Peripheral Configuration Sub-group
 * @{
 */
/*!
 * @brief Sets the QSCI register value to reset value.
 *
 * @param base QSCI peripheral base address.
 */
static inline void QSCI_Reset(QSCI_Type *base)
{
    base->RATE  = 0x200U;
    base->CTRL1 = 0U;
    base->CTRL2 = 0U;
    base->CTRL3 = 0U;
}

/*!
 * @brief Enables or disables the QSCI transmitter.
 *
 * This function enables or disables the QSCI transmitter.
 *
 * @param base QSCI peripheral base address.
 * @param bEnable True to enable, false to disable.
 */
static inline void QSCI_EnableTx(QSCI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL1 |= QSCI_CTRL1_TE_MASK;
    }
    else
    {
        base->CTRL1 &= ~QSCI_CTRL1_TE_MASK;
    }
}

/*!
 * @brief Enables or disables the QSCI receiver.
 *
 * This function enables or disables the QSCI receiver.
 *
 * @param base QSCI peripheral base address.
 * @param bEnable True to enable, false to disable.
 */
static inline void QSCI_EnableRx(QSCI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL1 |= QSCI_CTRL1_RE_MASK;
    }
    else
    {
        base->CTRL1 &= ~QSCI_CTRL1_RE_MASK;
    }
}

/*!
 * @brief Enables/disables stop in wait.
 *
 * @param base QSCI peripheral base address.
 * @param bEnable true to enable, QSCI stops working in wait mode, false to disable, QSCI keeps working in wait mode
 */
static inline void QSCI_EnableStopInWait(QSCI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL1 |= QSCI_CTRL1_SWAI_MASK;
    }
    else
    {
        base->CTRL1 &= ~(uint8_t)QSCI_CTRL1_SWAI_MASK;
    }
}

/*!
 * @brief Enables/Disables 9-bit data mode for QSCI.
 *
 * @param base QSCI peripheral base address.
 * @param bEnable true to enable, false to disable.
 */
static inline void QSCI_Enable9bitMode(QSCI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL1 |= QSCI_CTRL1_M_MASK;
    }
    else
    {
        base->CTRL1 &= ~QSCI_CTRL1_M_MASK;
    }
}

/*!
 * @brief Enables/Disables standby mode.
 *
 * When QSCI is in standby mode, further receiver interrupt requests are inhibited waiting to be wake up. The wakeup
 * mode can be configured by @ref QSCI_SetWakeupMode. Hardware wakes the receiver by automatically disabling standby.
 *
 * @param base QSCI peripheral base address.
 * @param bEnable true to enable, false to disable.
 */
static inline void QSCI_EnableStandbyMode(QSCI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL1 |= QSCI_CTRL1_RWU_MASK;
    }
    else
    {
        base->CTRL1 &= ~QSCI_CTRL1_RWU_MASK;
    }
}

/*!
 * @brief Enable/Disable LIN slave mode.
 *
 * If enabled QSCI is in LIN slave mode. When break is detected, the baudrate register is
 * automatically adjusted to match the value measured from the sync character that follows.
 *
 * @param base QSCI peripheral base address.
 * @param bEnable true to enable, false to disable.
 */
static inline void QSCI_EnableLINSlaveMode(QSCI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL2 |= QSCI_CTRL2_LINMODE_MASK;
    }
    else
    {
        base->CTRL2 &= ~QSCI_CTRL2_LINMODE_MASK;
    }
}

/*!
 * @brief Enable/Disable stop mode hold off.
 *
 * When enabled, if chip level stop mode occurs and transmiter or receiver is still busy,
 * QSCI will hold off stop mode until both transmiter and receiver are idle.
 *
 * @param base QSCI peripheral base address.
 * @param bEnable true to enable, false to disable.
 */
static inline void QSCI_EnableStopHold(QSCI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL3 |= QSCI_CTRL3_SHEN_MASK;
    }
    else
    {
        base->CTRL3 &= ~QSCI_CTRL3_SHEN_MASK;
    }
}

/*!
 * @brief Sets the QSCI transfer mode.
 *
 * @param base QSCI peripheral base address.
 * @param eTransferMode The QSCI tx/rx loop mode, #kQSCI_Normal to use normal transfer, #kQSCI_LoopInternal to let
 * internal tx feed back to rx, #kQSCI_SingleWire to use single wire mode using tx pin as tx and rx.
 */
static inline void QSCI_SetTransferMode(QSCI_Type *base, qsci_transfer_mode_t eTransferMode)
{
    if (eTransferMode == kQSCI_Normal)
    {
        base->CTRL1 &= ~QSCI_CTRL1_LOOP_MASK;
    }
    else
    {
        base->CTRL1 |= QSCI_CTRL1_LOOP_MASK;
        if (eTransferMode == kQSCI_LoopInternal)
        {
            base->CTRL1 &= ~QSCI_CTRL1_RSRC_MASK;
        }
        else
        {
            base->CTRL1 |= QSCI_CTRL1_RSRC_MASK;
        }
    }
}

/*!
 * @brief Sets wakeup mode for QSCI.
 *
 * @param base QSCI peripheral base address.
 * @param eWakeupMode Wakeup mode, #kQSCI_WakeupOnIdleLine or #kQSCI_WakeupOnAddressMark.
 */
static inline void QSCI_SetWakeupMode(QSCI_Type *base, qsci_wakeup_mode_t eWakeupMode)
{
    if (eWakeupMode == kQSCI_WakeupOnAddressMark)
    {
        base->CTRL1 |= QSCI_CTRL1_WAKE_MASK;
    }
    else
    {
        base->CTRL1 &= ~QSCI_CTRL1_WAKE_MASK;
    }
}

/*!
 * @brief Sets polarity mode for QSCI.
 *
 * @param base QSCI peripheral base address.
 * @param ePolarityMode Polarity mode, #kQSCI_PolarityNormal or #kQSCI_PolarityInvert.
 */
static inline void QSCI_SetPolarityMode(QSCI_Type *base, qsci_polarity_mode_t ePolarityMode)
{
    if (ePolarityMode == kQSCI_PolarityInvert)
    {
        base->CTRL1 |= QSCI_CTRL1_POL_MASK;
    }
    else
    {
        base->CTRL1 &= ~QSCI_CTRL1_POL_MASK;
    }
}

/*!
 * @brief Sets parity mode for QSCI.
 *
 * @param base QSCI peripheral base address.
 * @param eParityMode Polarity mode, #kQSCI_ParityDisabled, #kQSCI_ParityEven or #kQSCI_ParityOdd.
 */
static inline void QSCI_SetParityMode(QSCI_Type *base, qsci_parity_mode_t eParityMode)
{
    if (eParityMode == kQSCI_ParityDisabled)
    {
        base->CTRL1 &= ~QSCI_CTRL1_PE_MASK;
    }
    else
    {
        base->CTRL1 |= QSCI_CTRL1_PE_MASK;
        if (eParityMode == kQSCI_ParityEven)
        {
            base->CTRL1 &= ~QSCI_CTRL1_PT_MASK;
        }
        else
        {
            base->CTRL1 |= QSCI_CTRL1_PT_MASK;
        }
    }
}

/*!
 * @brief Sets the QSCI instance baud rate.
 *
 * This function configures the QSCI module baud rate. This function can be used to update QSCI module baud rate after
 * the QSCI module is initialized by the @ref QSCI_Init.
 *
 * @param base QSCI peripheral base address.
 * @param u32BaudRateBps QSCI baudrate to be set.
 * @param u32SrcClockHz QSCI clock source frequency in Hz.
 * @retval kStatus_QSCI_BaudrateNotSupport Baudrate is not supported in the current clock source.
 * @retval kStatus_Success Set baudrate succeeded.
 */
status_t QSCI_SetBaudRate(QSCI_Type *base, uint32_t u32BaudRateBps, uint32_t u32SrcClockHz);
/* @} */

/*!
 * @name FIFO Configuration Sub-group
 * @{
 */
/*!
 * @brief Enables/Disables transmitter/receiver FIFO.
 *
 * @param base QSCI peripheral base address.
 * @param bEnable true to enable, false to disable.
 */
static inline void QSCI_EnableFifo(QSCI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL2 |= QSCI_CTRL2_FIFO_EN_MASK;
    }
    else
    {
        base->CTRL2 &= ~QSCI_CTRL2_FIFO_EN_MASK;
    }
}

/*!
 * @brief Sets transmitter watermark.
 *
 * @param base QSCI peripheral base address.
 * @param eTxFifoWatermark Tx water mark level.
 */
static inline void QSCI_SetTxWaterMark(QSCI_Type *base, qsci_tx_water_t eTxFifoWatermark)
{
    base->CTRL2 = base->CTRL2 & (~QSCI_CTRL2_TFWM_MASK) | QSCI_CTRL2_TFWM(eTxFifoWatermark);
}

/*!
 * @brief Sets receiver watermark.
 *
 * @param base QSCI peripheral base address.
 * @param eRxFifoWatermark Rx water mark level.
 */
static inline void QSCI_SetRxWaterMark(QSCI_Type *base, qsci_rx_water_t eRxFifoWatermark)
{
    base->CTRL2 = base->CTRL2 & (~QSCI_CTRL2_RFWM_MASK) | QSCI_CTRL2_RFWM(eRxFifoWatermark);
}
/* @} */

/*!
 * @name DMA Configuration Sub-group
 * @{
 */
/*!
 * @brief Enables or disables the QSCI transmitter DMA request.
 *
 * This function enables or disables CTRL2[TDE], to generate the DMA requests when Tx data register is empty.
 *
 * @param base QSCI peripheral base address.
 * @param bEnable True to enable, false to disable.
 */
static inline void QSCI_EnableTxDMA(QSCI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL2 |= QSCI_CTRL2_TDE_MASK;
    }
    else
    {
        base->CTRL2 &= ~QSCI_CTRL2_TDE_MASK;
    }
}

/*!
 * @brief Enables or disables the QSCI receiver DMA request.
 *
 * This function enables or disables CTRL2[RDE], to generate DMA requests when receiver data register is full.
 *
 * @param base QSCI peripheral base address.
 * @param bEnable True to enable, false to disable.
 */
static inline void QSCI_EnableRxDMA(QSCI_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL2 |= QSCI_CTRL2_RDE_MASK;
    }
    else
    {
        base->CTRL2 &= ~QSCI_CTRL2_RDE_MASK;
    }
}

/*!
 * @brief Gets the QSCI data register byte address.
 *
 * This function returns the QSCI data register address, which is mainly used by DMA/eDMA.
 *
 * @param base QSCI peripheral base address.
 * @return QSCI data register byte addresses which are used both by the transmitter and the receiver.
 */
static inline uint32_t QSCI_GetDataRegisterAddress(QSCI_Type *base)
{
    return (uint32_t)((uint8_t *)&(base->DATA));
}
/* @} */

/*!
 * @name Bus Operation Sub-group
 * @{
 */

/*!
 * @brief Writes to the TX register.
 *
 * This function writes data to the TX register directly. The upper layer must ensure
 * that the TX register is empty or TX FIFO has room before calling this function.
 *
 * @param base QSCI peripheral base address.
 * @param u8Data The byte to write.
 */
static inline void QSCI_WriteByte(QSCI_Type *base, uint8_t u8Data)
{
    base->DATA = u8Data;
}

/*!
 * @brief Sends an address frame in 9-bit data mode.
 *
 * @param base QSCI peripheral base address.
 * @param u8Address QSCI slave address.
 */
static inline void QSCI_SendAddress(QSCI_Type *base, uint8_t u8Address)
{
    uint16_t u16Data = 0x100U | (uint16_t)u8Address;
    base->DATA       = u16Data;
}

/*!
 * @brief Reads the RX register directly.
 *
 * This function reads data from the RX register directly. The upper layer must
 * ensure that the RX register is full or that the TX FIFO has data before calling this function.
 *
 * @param base QSCI peripheral base address.
 * @return The byte read from QSCI data register.
 */
static inline uint8_t QSCI_ReadByte(QSCI_Type *base)
{
    return (uint8_t)(base->DATA);
}

/*!
 * @brief Writes TX register using a blocking method.
 *
 * This function polls the TX register, waits TX register to be empty or TX FIFO
 * have room then writes data to the TX buffer.
 *
 * @param base QSCI peripheral base address.
 * @param pu8Data Start address of the data to write.
 * @param u32Length Size of the data to write.
 */
void QSCI_WriteBlocking(QSCI_Type *base, const uint8_t *pu8Data, uint32_t u32Length);

/*!
 * @brief Reads RX data register using a blocking method.
 *
 * This function polls the RX register, waits RX register to be full or RX FIFO
 * have data, then reads data from the RX register.
 *
 * @param base QSCI peripheral base address.
 * @param pu8Data Start address of the buffer to store the received data.
 * @param u32Length Size of the buffer.
 * @retval kStatus_Fail Receiver error occurred while receiving data.
 * @retval kStatus_QSCI_RxHardwareOverrun Receiver overrun occurred while receiving data
 * @retval kStatus_QSCI_NoiseError Noise error occurred while receiving data
 * @retval kStatus_QSCI_FramingErrorFraming error occurred while receiving data
 * @retval kStatus_QSCI_ParityError Parity error occurred while receiving data
 * @retval kStatus_Success Successfully received all data.
 */
status_t QSCI_ReadBlocking(QSCI_Type *base, uint8_t *pu8Data, uint32_t u32Length);

/*!
 * @brief Sends one break character (10 or 11 bits of zeroes).
 *
 * @param base QSCI peripheral base address.
 */
static inline void QSCI_SendBreak(QSCI_Type *base)
{
    base->CTRL1 |= QSCI_CTRL1_SBK_MASK;
    base->CTRL1 &= ~QSCI_CTRL1_SBK_MASK;
}
/* @} */

/*!
 * @name Transactional APIs
 * @{
 */
/*!
 * @brief Initializes the QSCI handle.
 *
 * This function initializes the QSCI handle which can be used for other QSCI transactional APIs. Usually, for a
 * specified QSCI instance, call this API once to get the initialized handle.
 *
 * @param base QSCI peripheral base address.
 * @param psHhandle QSCI handle pointer.
 * @param pfCallback The callback function.
 * @param pUserData The parameter of the callback function.
 */
void QSCI_TransferCreateHandle(QSCI_Type *base,
                               qsci_transfer_handle_t *psHhandle,
                               qsci_transfer_callback_t pfCallback,
                               void *pUserData);

/*!
 * @brief Sets up the RX ring buffer.
 *
 * This function sets up the RX ring buffer to a specific QSCI handle.
 *
 * When the RX ring buffer is used, data received are stored into the ring buffer even when the
 * user doesn't call the QSCI_TransferReceiveNonBlocking() API. If data is already received
 * in the ring buffer, the user can get the received data from the ring buffer directly.
 *
 * @note When using the RX ring buffer, one byte is reserved for internal use. In other
 * words, if @p ringBufferSize is 32, only 31 bytes are used for saving data.
 *
 * @param psHandle QSCI handle pointer.
 * @param pu8RxRingBuffer Start address of the ring buffer for background receiving. Pass NULL to disable the ring
 * buffer.
 * @param u16RxRingBufferSize Size of the ring buffer.
 */
void QSCI_TransferStartRingBuffer(qsci_transfer_handle_t *psHandle,
                                  uint8_t *pu8RxRingBuffer,
                                  uint16_t u16RxRingBufferSize);

/*!
 * @brief Aborts the background transfer and uninstalls the ring buffer.
 *
 * This function aborts the background transfer and uninstalls the ring buffer.
 *
 * @param psHandle QSCI handle pointer.
 */
void QSCI_TransferStopRingBuffer(qsci_transfer_handle_t *psHandle);

/*!
 * @brief Get the ring buffer valid data length.
 *
 * @param psHandle QSCI handle pointer.
 * @return Valid data length in ring buffer.
 */
uint16_t QSCI_TransferGetRxRingBufferLength(qsci_transfer_handle_t *psHandle);

/*!
 * @brief Transmits a buffer of data using the interrupt method.
 *
 * This function sends data using an interrupt method. This is a non-blocking function, which
 * returns directly without waiting for all data to be written to the TX register. When
 * all data is sent out, the QSCI driver calls the callback function and passes the
 * @ref kStatus_QSCI_TxIdle as status parameter.
 *
 * @param psHandle QSCI handle pointer.
 * @param psTransfer QSCI transfer structure. See #qsci_transfer_t.
 * @retval kStatus_Success Successfully start the data transmission.
 * @retval kStatus_QSCI_TxBusy Previous transmission still not finished; data not all written to TX register yet.
 */
status_t QSCI_TransferSendNonBlocking(qsci_transfer_handle_t *psHandle, qsci_transfer_t *psTransfer);

/*!
 * @brief Aborts the interrupt-driven data transmit.
 *
 * This function aborts the interrupt-driven data sending. The user can get the remainBytes to find out
 * how many bytes are not sent out.
 *
 * @param psHandle QSCI handle pointer.
 */
void QSCI_TransferAbortSend(qsci_transfer_handle_t *psHandle);

/*!
 * @brief Gets the number of bytes sent out to bus.
 *
 * This function gets the number of bytes sent out to bus by using the interrupt method.
 *
 * @param psHandle QSCI handle pointer.
 * @param pu32Count Send bytes count.
 * @retval kStatus_NoTransferInProgress No send in progress.
 * @retval kStatus_Success Get successfully through the parameter \p count;
 */
status_t QSCI_TransferGetSendCount(qsci_transfer_handle_t *psHandle, uint32_t *pu32Count);

/*!
 * @brief Receives a buffer of data using an interrupt method.
 *
 * This function receives data using an interrupt method. This is a non-blocking function, which
 *  returns without waiting for all data to be received.
 * If the RX ring buffer is used and not empty, the data in the ring buffer is copied and
 * the parameter @p pu32ReceivedBytes shows how many bytes are copied from the ring buffer.
 * After copying, if the data in the ring buffer is not enough to read, the receive
 * request is saved by the QSCI driver. When the new data arrives, the receive request
 * is serviced first. When all data is received, the QSCI driver notifies the upper layer
 * through a callback function and passes the status parameter @ref kStatus_QSCI_RxIdle.
 * For example, the upper layer needs 10 bytes but there are only 5 bytes in the ring buffer.
 * The 5 bytes are copied to the psTransfer->data and this function returns with the
 * parameter @p pu32ReceivedBytes set to 5. For the left 5 bytes, newly arrived data is
 * saved from the psTransfer->data[5]. When 5 bytes are received, the QSCI driver notifies the upper layer.
 * If the RX ring buffer is not enabled, this function enables the RX and RX interrupt
 * to receive data to the psTransfer->data. When all data is received, the upper layer is notified.
 *
 * @param psHandle QSCI handle pointer.
 * @param psTransfer QSCI transfer structure, see #qsci_transfer_t.
 * @param pu32ReceivedBytes Bytes received from the ring buffer directly.
 * @retval kStatus_Success Successfully queue the transfer into transmit queue.
 * @retval #kStatus_QSCI_RxBusy Previous receive request is not finished.
 */
status_t QSCI_TransferReceiveNonBlocking(qsci_transfer_handle_t *psHandle,
                                         qsci_transfer_t *psTransfer,
                                         size_t *pu32ReceivedBytes);

/*!
 * @brief Aborts the interrupt-driven data receiving.
 *
 * This function aborts the interrupt-driven data receiving. The user can get the remainBytes to know
 * how many bytes are not received yet.
 *
 * @param psHandle QSCI handle pointer.
 */
void QSCI_TransferAbortReceive(qsci_transfer_handle_t *psHandle);

/*!
 * @brief Gets the number of bytes that have been received.
 *
 * This function gets the number of bytes that have been received.
 *
 * @param psHandle QSCI handle pointer.
 * @param pu32Count Receive bytes count.
 * @retval kStatus_NoTransferInProgress No receive in progress.
 * @retval kStatus_InvalidArgument Parameter is invalid.
 * @retval kStatus_Success Get successfully through the parameter \p pu32Count;
 */
status_t QSCI_TransferGetReceiveCount(qsci_transfer_handle_t *psHandle, uint32_t *pu32Count);
/* @} */

/*!
 * @brief Get the QSCI instance from peripheral base address.
 *
 * @param base QSCI peripheral base address.
 * @return QSCI instance.
 */
uint16_t QSCI_GetInstance(QSCI_Type *base);

#if defined(__cplusplus)
}
#endif;

/*! @}*/

#endif /* _FSL_QSCI_H_*/
